tylertms/dspic33e-sim/conformance/pmp.c
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} PmpConformance;

enum {
    PMP_CONTROL = 0x0600u,
    PMP_MODE = 0x0602u,
    PMP_ADDRESS = 0x0604u,
    PMP_DATA = 0x0608u,
    PMP_STATUS = 0x060eu,
    PMP_ENABLE = 0x8000u,
    PMP_BUSY = 0x8000u,
    PMP_INTERRUPT_EACH = 0x2000u,
    PMP_INCREMENT = 0x0800u,
    PMP_DECREMENT = 0x1000u,
    PMP_DATA_16_BIT = 0x0400u,
    PMP_MASTER_MODE_2 = 0x0200u,
    PMP_MASTER_MODE_3 = 0x0300u,
    PMP_PARTIAL_MUX = 0x0800u,
    PMP_FULL_MUX = 0x1000u,
    PMP_ONE_CHIP_SELECT = 0x0040u,
    PMP_TWO_CHIP_SELECTS = 0x0080u,
    PMP_FIRMWARE_MODE = 0x22beu,
    PMP_INTERRUPT_FLAG = 0x2000u,
    PMP_INTERRUPT_ENABLE = 0x2000u,
    PMP_IRQ = 45u,
    PMP_PRIORITY = 3u,
    PMP_VECTOR = 0x0100u,
    PMP_DMA_REQUEST = 0x2du,
    PMP_DMA_CHANNEL = 10u,
    PMP_DMA_BASE = 0x0ba0u,
    PMP_DMA_SOURCE = 0x2000u,
    PMP_TRANSFER_COUNT = 8192u
};

static void expect(PmpConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[pmp-failed] %s\n", name);
    }
}

static void configure_pmp_control(Dspic33* cpu, uint16_t control, uint16_t mode,
                                  uint16_t address) {
    dspic33_write_word(cpu, PMP_CONTROL, 0u);
    dspic33_write_word(cpu, PMP_MODE, mode);
    dspic33_write_word(cpu, PMP_ADDRESS, address);
    dspic33_write_word(cpu, PMP_CONTROL, (uint16_t)(control | PMP_ENABLE));
}

static void configure_pmp(Dspic33* cpu, uint16_t mode, uint16_t address) {
    configure_pmp_control(cpu, 0u, mode, address);
}

static void configure_dma(Dspic33* cpu, uint8_t channel, uint8_t request,
                          uint32_t source, uint16_t pad, uint16_t count) {
    uint16_t base = (uint16_t)(0x0b00u + channel * 0x10u);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)source);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(source >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0au), 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, 0xe001u);
}

static void access_cases(PmpConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_read_word(cpu, PMP_CONTROL) == 0u, "PMCON reset");
    expect(state, dspic33_read_word(cpu, PMP_MODE) == 0u, "PMMODE reset");
    expect(state, dspic33_read_word(cpu, PMP_STATUS) == 0x008fu, "PMSTAT reset");
    dspic33_write_word(cpu, PMP_CONTROL, 0xffffu);
    dspic33_write_word(cpu, PMP_MODE, 0xffffu);
    dspic33_write_word(cpu, PMP_STATUS, 0xffffu);
    expect(state, dspic33_read_word(cpu, PMP_CONTROL) == 0xbfffu, "PMCON mask");
    expect(state, dspic33_read_word(cpu, PMP_MODE) == 0x7fffu, "PMMODE BUSY read only");
    expect(state, dspic33_read_word(cpu, PMP_STATUS) == 0x40cfu, "PMSTAT access mask");
}

static void timing_cases(PmpConformance* state, Dspic33* cpu) {
    Dspic33PmpTransfer transfer;
    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, (uint16_t)(PMP_INTERRUPT_EACH | PMP_MASTER_MODE_2), 0x1234u);
    dspic33_write_byte(cpu, PMP_DATA, 0x5au);
    expect(state, cpu->io.pmp.active, "WAITM zero starts transfer");
    expect(state, (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) == 0u,
           "one-cycle transfer has no sampled BUSY interval");
    expect(state, !dspic33_pmp_transmit(cpu, &transfer),
           "transfer unavailable before completion");
    expect(state, dspic33_device_advance(cpu, 1u), "advance one-cycle transfer");
    expect(state, dspic33_pmp_transmit(cpu, &transfer), "one-cycle transfer completes");
    expect(state,
           transfer.address == 0x1234u && transfer.value == 0x5au &&
               transfer.cycle == 1u,
           "one-cycle transfer captures address data and cycle");

    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0x4567u);
    dspic33_write_byte(cpu, PMP_DATA, 0x11u);
    expect(state, (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) != 0u,
           "firmware timing asserts BUSY");
    dspic33_write_byte(cpu, PMP_DATA, 0x22u);
    dspic33_write_word(cpu, PMP_ADDRESS, 0x7654u);
    dspic33_write_word(cpu, PMP_MODE, PMP_MASTER_MODE_2);
    expect(state, dspic33_device_advance(cpu, 20u),
           "advance before firmware completion");
    expect(state,
           (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) == 0u &&
               !dspic33_pmp_transmit(cpu, &transfer),
           "final cycle clears BUSY before completion");
    dspic33_write_word(cpu, PMP_MODE, PMP_FIRMWARE_MODE);
    dspic33_write_byte(cpu, PMP_DATA, 0x33u);
    expect(state, (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) != 0u,
           "final cycle admits back-to-back transfer");
    expect(state, dspic33_device_advance(cpu, 1u), "advance firmware completion");
    expect(state, dspic33_pmp_transmit(cpu, &transfer), "firmware transfer completes");
    expect(state,
           transfer.address == 0x4567u && transfer.value == 0x11u &&
               transfer.mode == PMP_FIRMWARE_MODE && transfer.cycle == 21u,
           "active transfer retains captured configuration");
    expect(state,
           !dspic33_pmp_transmit(cpu, &transfer) && cpu->io.pmp.active &&
               (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) != 0u,
           "first completion preserves back-to-back transfer");
    expect(state, dspic33_device_advance(cpu, 19u), "advance back-to-back final cycle");
    expect(state,
           (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) == 0u &&
               !dspic33_pmp_transmit(cpu, &transfer),
           "back-to-back final cycle clears BUSY before completion");
    expect(state, dspic33_device_advance(cpu, 1u), "advance back-to-back completion");
    expect(state,
           dspic33_pmp_transmit(cpu, &transfer) && transfer.address == 0x7654u &&
               transfer.value == 0x33u && transfer.cycle == 41u,
           "back-to-back transfer completes independently");
    expect(state, !dspic33_pmp_transmit(cpu, &transfer),
           "busy write does not queue transfer");
}

