tylertms/dspic33e-sim/conformance/pmp.c
static void interrupt_cases(PmpConformance* state, Dspic33* cpu) {
    Dspic33PmpTransfer transfer;
    uint16_t priority_address = (uint16_t)(0x0840u + (PMP_IRQ / 4u) * 2u);
    uint16_t priority_shift = (uint16_t)((PMP_IRQ % 4u) * 4u);
    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, PMP_MASTER_MODE_2, 0u);
    dspic33_write_byte(cpu, PMP_DATA, 0x33u);
    expect(state, dspic33_device_advance(cpu, 1u), "noninterrupting PMP completes");
    expect(state, dspic33_pmp_transmit(cpu, &transfer),
           "noninterrupting output captured");
    expect(state, (dspic33_read_word(cpu, 0x0804u) & PMP_INTERRUPT_FLAG) == 0u,
           "IRQM zero does not raise PMPIF");

    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, (uint16_t)(PMP_INTERRUPT_EACH | PMP_MASTER_MODE_2), 0u);
    dspic33_write_byte(cpu, PMP_DATA, 0x44u);
    expect(state, dspic33_device_advance(cpu, 1u), "interrupting PMP completes");
    expect(state, (dspic33_read_word(cpu, 0x0804u) & PMP_INTERRUPT_FLAG) != 0u,
           "IRQM each raises PMPIF");

    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, (uint16_t)(PMP_INTERRUPT_EACH | PMP_MASTER_MODE_2), 0u);
    dspic33_write_word(cpu, 0x0824u, PMP_INTERRUPT_ENABLE);
    dspic33_write_word(cpu, priority_address,
                       (uint16_t)((dspic33_read_word(cpu, priority_address) &
                                   ~(7u << priority_shift)) |
                                  (PMP_PRIORITY << priority_shift)));
    cpu->program[(0x0014u + PMP_IRQ * 2u) / 2u] = PMP_VECTOR;
    cpu->w[15] = 0x1800u;
    dspic33_write_byte(cpu, PMP_DATA, 0x45u);
    expect(state, dspic33_device_advance(cpu, 1u), "vectored PMP completes");
    expect(state, dspic33_device_interrupt_pending(cpu), "PMP interrupt pending");
    expect(state,
           dspic33_device_service_interrupt(cpu) && cpu->last_interrupt == PMP_IRQ &&
               cpu->pc == PMP_VECTOR,
           "PMP interrupt 45 vectors");
}

static void dma_chain_cases(PmpConformance* state, Dspic33* cpu) {
    Dspic33PmpTransfer transfer;
    uint16_t index;
    dspic33_reset(cpu, 0u);
    for (index = 0u; index < PMP_TRANSFER_COUNT; index++) {
        dspic33_write_byte(cpu, (uint16_t)(PMP_DMA_SOURCE + index), (uint8_t)index);
    }
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    configure_dma(cpu, PMP_DMA_CHANNEL, PMP_DMA_REQUEST, PMP_DMA_SOURCE, PMP_DATA,
                  PMP_TRANSFER_COUNT - 1u);
    dspic33_write_word(cpu, (uint16_t)(PMP_DMA_BASE + 2u),
                       (uint16_t)(0x8000u | PMP_DMA_REQUEST));
    expect(state, dspic33_device_advance(cpu, PMP_TRANSFER_COUNT * 23u),
           "advance complete display DMA chain");
    expect(state, cpu->io.pmp.output.count == PMP_TRANSFER_COUNT,
           "display DMA emits complete frame");
    expect(state, (dspic33_read_word(cpu, PMP_DMA_BASE) & 0x8000u) == 0u,
           "display DMA one-shot channel disables");
    expect(state,
           cpu->io.dma_index[PMP_DMA_CHANNEL] == 0u &&
               (dspic33_read_word(cpu, 0x080eu) & 0x0100u) != 0u,
           "display DMA completes block and raises DMA10IF");
    for (index = 0u; index < PMP_TRANSFER_COUNT; index++) {
        bool available = dspic33_pmp_transmit(cpu, &transfer);
        if (!available || transfer.value != (uint8_t)index) {
            break;
        }
    }
    expect(state, index == PMP_TRANSFER_COUNT, "display DMA preserves all byte values");
    expect(state, !dspic33_pmp_transmit(cpu, &transfer), "display output queue drains");
}

static void dma_negative_cases(PmpConformance* state, Dspic33* cpu) {
    Dspic33PmpTransfer transfer;
    uint8_t value;
    dspic33_reset(cpu, 0u);
    for (value = 0u; value < 4u; value++) {
        dspic33_write_byte(cpu, (uint16_t)(0x4000u + value), (uint8_t)(0xa0u + value));
    }
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    configure_dma(cpu, 0u, PMP_DMA_REQUEST, 0x4000u, PMP_DATA, 3u);
    dspic33_write_word(cpu, 0x0b02u, (uint16_t)(0x8000u | PMP_DMA_REQUEST));
    expect(state, dspic33_device_advance(cpu, 100u), "advance alternate DMA channel");
    for (value = 0u; value < 4u; value++) {
        if (!dspic33_pmp_transmit(cpu, &transfer) ||
            transfer.value != (uint8_t)(0xa0u + value)) {
            break;
        }
    }
    expect(state, value == 4u, "generic PMP request chains alternate DMA channel");

    dspic33_reset(cpu, 0u);
    dspic33_write_byte(cpu, 0x4000u, 0x51u);
    dspic33_write_byte(cpu, 0x4001u, 0x52u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    configure_dma(cpu, 0u, 0x2cu, 0x4000u, PMP_DATA, 1u);
    dspic33_write_word(cpu, 0x0b02u, 0x802cu);
    expect(state, dspic33_device_advance(cpu, 100u), "advance wrong request chain");
    expect(state,
           dspic33_pmp_transmit(cpu, &transfer) && transfer.value == 0x51u &&
               !dspic33_pmp_transmit(cpu, &transfer),
           "wrong IRQSEL stops after forced byte");

    dspic33_reset(cpu, 0u);
    dspic33_write_byte(cpu, 0x4000u, 0x61u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    configure_dma(cpu, 0u, PMP_DMA_REQUEST, 0x4000u, (uint16_t)(PMP_DATA + 2u), 0u);
    dspic33_write_word(cpu, 0x0b02u, (uint16_t)(0x8000u | PMP_DMA_REQUEST));
    expect(state, dspic33_device_advance(cpu, 30u), "advance wrong PAD transfer");
    expect(state, !dspic33_pmp_transmit(cpu, &transfer),
           "wrong PAD does not start PMP");

    dspic33_reset(cpu, 0u);
    dspic33_write_byte(cpu, 0x4000u, 0x71u);
    dspic33_write_byte(cpu, 0x4001u, 0x72u);
    configure_pmp(cpu, PMP_MASTER_MODE_2, 0u);
    configure_dma(cpu, 0u, PMP_DMA_REQUEST, 0x4000u, PMP_DATA, 1u);
    dspic33_write_word(cpu, 0x0b02u, (uint16_t)(0x8000u | PMP_DMA_REQUEST));
    expect(state, dspic33_device_advance(cpu, 30u), "advance IRQM zero chain");
    expect(state,
           dspic33_pmp_transmit(cpu, &transfer) && transfer.value == 0x71u &&
               !dspic33_pmp_transmit(cpu, &transfer),
           "IRQM zero stops after forced byte");
}

static void lifecycle_cases(PmpConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    Dspic33PmpTransfer original_transfer;
    Dspic33PmpTransfer copy_transfer;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize PMP copy");
    if (!initialized) {
        return;
    }
    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0x1111u);
    dspic33_write_byte(cpu, PMP_DATA, 0x81u);
    expect(state, dspic33_device_advance(cpu, 1u), "begin copied PMP transfer");
    expect(state, dspic33_copy(&copy, cpu), "copy active PMP");
    expect(state,
           copy.io.pmp.active && copy.io.pmp.value == 0x81u && copy.events.count == 2u,
           "copy retains PMP event state");
    expect(state,
           dspic33_device_advance(cpu, 20u) && dspic33_device_advance(&copy, 20u),
           "complete source and copied PMP");
    expect(state,
           dspic33_pmp_transmit(cpu, &original_transfer) &&
               dspic33_pmp_transmit(&copy, &copy_transfer) &&
               original_transfer.value == copy_transfer.value &&
               original_transfer.address == copy_transfer.address,
           "copied PMP completes independently");

    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    dspic33_write_byte(cpu, PMP_DATA, 0x91u);
    dspic33_write_word(cpu, PMP_CONTROL, 0u);
    expect(state,
           !cpu->io.pmp.active && (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) == 0u,
           "PMP disable aborts active transfer");
    expect(state, dspic33_device_advance(cpu, 21u), "advance stale PMP event");
    expect(state, !dspic33_pmp_transmit(cpu, &original_transfer),
           "stale PMP event produces no output");

    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    cpu->io.pmp.output.count = DSPIC33_PMP_QUEUE_SIZE;
    dspic33_write_byte(cpu, PMP_DATA, 0xa1u);
    expect(state, !dspic33_device_advance(cpu, 21u), "full output queue stops advance");
    expect(state, cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "full PMP output queue reports error");

    dspic33_reset(cpu, 0u);
    configure_pmp(cpu, PMP_FIRMWARE_MODE, 0u);
    cpu->device_cycles = UINT64_MAX;
    dspic33_write_byte(cpu, PMP_DATA, 0xb1u);
    expect(state,
           !cpu->io.pmp.active && cpu->events.count == 0u &&
               (dspic33_read_word(cpu, PMP_MODE) & PMP_BUSY) == 0u,
           "PMP scheduling overflow rolls back transfer");
    dspic33_destroy(&copy);
}

int main(void) {
    Dspic33 cpu;
    PmpConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize PMP processor");
    if (initialized) {
        access_cases(&state, &cpu);
        timing_cases(&state, &cpu);
        access_lane_cases(&state, &cpu);
        sixteen_bit_lane_cases(&state, &cpu);
        master_write_matrix_cases(&state, &cpu);
        wait_state_matrix_cases(&state, &cpu);
        address_update_cases(&state, &cpu);
        interrupt_cases(&state, &cpu);
        dma_chain_cases(&state, &cpu);
        dma_negative_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[pmp-summary] cases=%u passed=%u failed=%u\n", state.cases, state.passed,
           state.failed);
    return state.failed == 0u ? 0 : 1;
}
